OpenNuvoton/MS51BSP_IAR/MS51DA9AE_MS51BA9AE/Library/Device/Include/Function_define_MS51_8K_IAR.h
#define    PWM0_CH5_OUTPUT_INVERSE                 PNP|=0x20
#define    PWM0_CH4_OUTPUT_INVERSE                 PNP|=0x10
#define    PWM0_CH3_OUTPUT_INVERSE                 PNP|=0x08
#define    PWM0_CH2_OUTPUT_INVERSE                 PNP|=0x04
#define    PWM0_CH1_OUTPUT_INVERSE                 PNP|=0x02
#define    PWM0_CH0_OUTPUT_INVERSE                 PNP|=0x01
                                                   
#define    PWM0_CH5_OUTPUT_NORMAL                  PNP&=0xDF
#define    PWM0_CH4_OUTPUT_NORMAL                  PNP&=0xEF
#define    PWM0_CH3_OUTPUT_NORMAL                  PNP&=0xF7
#define    PWM0_CH2_OUTPUT_NORMAL                  PNP&=0xFB
#define    PWM0_CH1_OUTPUT_NORMAL                  PNP&=0xFD
#define    PWM0_CH0_OUTPUT_NORMAL                  PNP&=0xFE
/*--------- PWM type define ------------------------------------*/
#define    PWM0_EDGE_TYPE                          PWMCON1&=0xEF
#define    PWM0_CENTER_TYPE                        PWMCON1|=0x10
/*--------- PWM mode define ------------------------------------*/
#define    PWM0_IMDEPENDENT_MODE                   PWMCON1&=0x3F
#define    PWM0_COMPLEMENTARY_MODE                 PWMCON1&=0x3F;PWMCON1|=0x40
#define    PWM0_SYNCHRONIZED_MODE                  PWMCON1&=0x3F;PWMCON1|=0x80
#define    ENABLE_PWM_GP_MODE                      PWMCON1|=0x20
#define    DISABLE_PWM_GP_MODE                     PWMCON1&=0xDF
//--------- PMW0 interrupt setting ------------------------------
#define    ENABLE_PWM0_FALLING_INT                 set_SFRS_SFRPAGE;PWMINTC&=0xCF;PWMINTC|=0x00;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_RISING_INT                  set_SFRS_SFRPAGE;PWMINTC&=0xCF;PWMINTC|=0x10;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_CENTRAL_POINT_INT           set_SFRS_SFRPAGE;PWMINTC&=0xCF;PWMINTC|=0x20;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_PERIOD_END_INT              set_SFRS_SFRPAGE;PWMINTC&=0xCF;PWMINTC|=0x30;clr_SFRS_SFRPAGE
//--------- PWM0 interrupt pin select --------------------------
#define    ENABLE_PWM0_CH0_INT                     set_SFRS_SFRPAGE;PWMINTC&=0xF8;PWMINTC|=0x00;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_CH1_INT                     set_SFRS_SFRPAGE;PWMINTC&=0xF8;PWMINTC|=0x01;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_CH2_INT                     set_SFRS_SFRPAGE;PWMINTC&=0xF8;PWMINTC|=0x02;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_CH3_INT                     set_SFRS_SFRPAGE;PWMINTC&=0xF8;PWMINTC|=0x03;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_CH4_INT                     set_SFRS_SFRPAGE;PWMINTC&=0xF8;PWMINTC|=0x04;clr_SFRS_SFRPAGE
#define    ENABLE_PWM0_CH5_INT                     set_SFRS_SFRPAGE;PWMINTC&=0xF8;PWMINTC|=0x05;clr_SFRS_SFRPAGE
//--------- PWM0 Dead time setting -----------------------------
#define    ENABLE_PWM0_CH45_DEADTIME               BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x04;EA=BIT_TMP
#define    ENABLE_PWM0_CH23_DEADTIME               BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x02;EA=BIT_TMP
#define    ENABLE_PWM0_CH01_DEADTIME               BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;PDTEN|=0x01;EA=BIT_TMP

/*****************************************************************************************/
/* For ADC setting                                                                       */
/*****************************************************************************************/
#define    DISABLE_ADC                            clr_SFRS_SFRPAGE;ADCCON1&=0xFE;
                                                 
#define    ENABLE_ADC_CH0                         clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x00;P17_INPUT_MODE;AINDIDS=0;AINDIDS|=0x01;ADCCON1|=0x01    //P17
#define    ENABLE_ADC_CH1                         clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x01;P30_INPUT_MODE;AINDIDS=0;AINDIDS|=0x02;ADCCON1|=0x01    //P30
#define    ENABLE_ADC_CH3                         clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x03;P06_INPUT_MODE;AINDIDS=0;AINDIDS|=0x08;ADCCON1|=0x01    //P06
#define    ENABLE_ADC_CH4                         clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x04;P05_INPUT_MODE;AINDIDS=0;AINDIDS|=0x10;ADCCON1|=0x01    //P05
#define    ENABLE_ADC_CH5                         clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x05;P04_INPUT_MODE;AINDIDS=0;AINDIDS|=0x20;ADCCON1|=0x01    //P04
#define    ENABLE_ADC_CH6                         clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x06;P03_INPUT_MODE;AINDIDS=0;AINDIDS|=0x40;ADCCON1|=0x01    //P03
#define    ENABLE_ADC_CH7                         clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x07;P01_INPUT_MODE;AINDIDS=0;AINDIDS|=0x80;ADCCON1|=0x01    //P11
#define    ENABLE_ADC_BANDGAP                     clr_SFRS_SFRPAGE;ADCCON0&=0xF0;ADCCON0|=0x08;ADCCON1|=0x01                                           //Band-gap 1.22V
                                                 
#define    PWM0_FALLINGEDGE_TRIG_ADC              clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM2_FALLINGEDGE_TRIG_ADC              clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM4_FALLINGEDGE_TRIG_ADC              clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM0_RISINGEDGE_TRIG_ADC               clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM2_RISINGEDGE_TRIG_ADC               clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM4_RISINGEDGE_TRIG_ADC               clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CENTRAL_TRIG_ADC                  clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM2_CENTRAL_TRIG_ADC                  clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM4_CENTRAL_TRIG_ADC                  clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_END_TRIG_ADC                      clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM2_END_TRIG_ADC                      clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM4_END_TRIG_ADC                      clr_SFRS_SFRPAGE;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
                                                 
#define    P04_FALLINGEDGE_TRIG_ADC               clr_SFRS_SFRPAGE;ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=0x02;ADCCON1&=0xBF
#define    P03_FALLINGEDGE_TRIG_ADC               clr_SFRS_SFRPAGE;ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=0x02;ADCCON1|=0x40
#define    P04_RISINGEDGE_TRIG_ADC                clr_SFRS_SFRPAGE;ADCCON0|=0x30;ADCCON1&=0xF7;ADCCON1|=0x04;ADCCON1|=0x02;ADCCON1&=0xBF
#define    P03_RISINGEDGE_TRIG_ADC                clr_SFRS_SFRPAGE;ADCCON0|=0x30;ADCCON1&=0xF7;ADCCON1|=0x04;ADCCON1|=0x02;ADCCON1|=0x40

